---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Field.FieldName
source: html/770477b9-db1c-627f-82cd-fb5ea4f7ebc3.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.FieldName Property

The name of the field.

## Syntax (C#)
```csharp
public string FieldName { get; }
```